____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 500)           0                                            
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, 500, 100)      862900                                       
____________________________________________________________________________________________________
bidirectional_1 (Bidirectional)  (None, 500, 600)      962400                                       
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 500, 700)      0                                            
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 500, 700)      0                                            
____________________________________________________________________________________________________
time_distributed_1 (TimeDistribu (None, 500, 300)      210300                                       
____________________________________________________________________________________________________
reshape_1 (Reshape)              (None, 500, 300, 1)   0                                            
____________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)   (None, 25, 300, 1)    0                                            
____________________________________________________________________________________________________
conv2d_1 (Conv2D)                (None, 25, 300, 10)   20                                           
____________________________________________________________________________________________________
conv2d_2 (Conv2D)                (None, 24, 300, 10)   30                                           
____________________________________________________________________________________________________
conv2d_3 (Conv2D)                (None, 23, 300, 10)   40                                           
____________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)   (None, 1, 300, 10)    0                                            
____________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)   (None, 1, 300, 10)    0                                            
____________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)   (None, 1, 300, 10)    0                                            
____________________________________________________________________________________________________
concatenate_2 (Concatenate)      (None, 3, 300, 10)    0                                            
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 3, 300, 10)    0                                            
____________________________________________________________________________________________________
reshape_2 (Reshape)              (None, 30, 300, 1)    0                                            
____________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)   (None, 1, 300, 1)     0                                            
____________________________________________________________________________________________________
flatten_1 (Flatten)              (None, 300)           0                                            
____________________________________________________________________________________________________
dropout_3 (Dropout)              (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 200)           60200                                        
____________________________________________________________________________________________________
dense_3 (Dense)                  (None, 2)             402                                          
====================================================================================================
Total params: 2,096,292.0
Trainable params: 1,233,392.0
Non-trainable params: 862,900.0
